HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxPsi5_regdef.h
/** \\brief  SMU Fractional Divider Register */
typedef struct _Ifx_PSI5_FDR_Bits
{
    unsigned int STEP:10;                   /**< \brief [9:0] Step Value (rw) */
    unsigned int reserved_10:4;             /**< \brief \internal Reserved */
    unsigned int DM:2;                      /**< \brief [15:14] Divider Mode (rw) */
    unsigned int RESULT:10;                 /**< \brief [25:16] Result Value (rh) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_PSI5_FDR_Bits;

/** \\brief  Fractional Divider Register for Higher Bit Rate */
typedef struct _Ifx_PSI5_FDRH_Bits
{
    unsigned int STEP:10;                   /**< \brief [9:0] Step Value (rw) */
    unsigned int reserved_10:4;             /**< \brief \internal Reserved */
    unsigned int DM:2;                      /**< \brief [15:14] Divider Mode (rw) */
    unsigned int RESULT:10;                 /**< \brief [25:16] Result Value (rh) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_PSI5_FDRH_Bits;

/** \\brief  Fractional Divider Register for Lower Bit Rate */
typedef struct _Ifx_PSI5_FDRL_Bits
{
    unsigned int STEP:10;                   /**< \brief [9:0] Step Value (rw) */
    unsigned int reserved_10:4;             /**< \brief \internal Reserved */
    unsigned int DM:2;                      /**< \brief [15:14] Divider Mode (rw) */
    unsigned int RESULT:10;                 /**< \brief [25:16] Result Value (rh) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_PSI5_FDRL_Bits;

/** \\brief  Fractional Divider Register for Time Stamp */
typedef struct _Ifx_PSI5_FDRT_Bits
{
    unsigned int STEP:10;                   /**< \brief [9:0] Step Value (rw) */
    unsigned int reserved_10:4;             /**< \brief \internal Reserved */
    unsigned int DM:2;                      /**< \brief [15:14] Divider Mode (rw) */
    unsigned int RESULT:10;                 /**< \brief [25:16] Result Value (rh) */
    unsigned int ECS:3;                     /**< \brief [28:26] External Time Stamp Clear Source Select (rw) */
    unsigned int ECEA:1;                    /**< \brief [29:29] External Time Stamp Clear Enable A (rw) */
    unsigned int ECEB:1;                    /**< \brief [30:30] External Time Stamp Clear Enable B (rw) */
    unsigned int ECEC:1;                    /**< \brief [31:31] External Time Stamp Clear Enable C (rw) */
} Ifx_PSI5_FDRT_Bits;

/** \\brief  Global Control Register */
typedef struct _Ifx_PSI5_GCR_Bits
{
    unsigned int CRCI:1;                    /**< \brief [0:0] CRCI (rw) */
    unsigned int NBI:1;                     /**< \brief [1:1] NBI (rw) */
    unsigned int MEI:1;                     /**< \brief [2:2] MEI (rw) */
    unsigned int NFI:1;                     /**< \brief [3:3] NFI (rw) */
    unsigned int TEI:1;                     /**< \brief [4:4] TEI (rw) */
    unsigned int reserved_5:3;              /**< \brief \internal Reserved */
    unsigned int ETC0:1;                    /**< \brief [8:8] Enable Channel Trigger Counter CTVx.CTC (rw) */
    unsigned int ETC1:1;                    /**< \brief [9:9] Enable Channel Trigger Counter CTVx.CTC (rw) */
    unsigned int ETC2:1;                    /**< \brief [10:10] Enable Channel Trigger Counter CTVx.CTC (rw) */
    unsigned int ETC3:1;                    /**< \brief [11:11] Enable Channel Trigger Counter CTVx.CTC (rw) */
    unsigned int ETC4:1;                    /**< \brief [12:12] Enable Channel Trigger Counter CTVx.CTC (rw) */
    unsigned int reserved_13:3;             /**< \brief \internal Reserved */
    unsigned int CEN0:1;                    /**< \brief [16:16] Enable Channel (rw) */
    unsigned int CEN1:1;                    /**< \brief [17:17] Enable Channel (rw) */
    unsigned int CEN2:1;                    /**< \brief [18:18] Enable Channel (rw) */
    unsigned int CEN3:1;                    /**< \brief [19:19] Enable Channel (rw) */
    unsigned int CEN4:1;                    /**< \brief [20:20] Enable Channel (rw) */
    unsigned int reserved_21:11;            /**< \brief \internal Reserved */
} Ifx_PSI5_GCR_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_PSI5_ID_Bits
{
    unsigned int MODREV:8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODTYPE:8;                 /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_PSI5_ID_Bits;

/** \\brief  Interrupt Node Pointer Register */
typedef struct _Ifx_PSI5_INP_Bits
{
    unsigned int RSI:4;                     /**< \brief [3:0] Interrupt Node Pointer for Interrupt RSI (rw) */
    unsigned int RDI:4;                     /**< \brief [7:4] Interrupt Node Pointer for Interrupt RDI (rw) */
    unsigned int RBI:4;                     /**< \brief [11:8] Interrupt Node Pointer for Interrupt RBI (rw) */
    unsigned int TDI:4;                     /**< \brief [15:12] Interrupt Node Pointer for Interrupt TDI (rw) */
    unsigned int TBI:4;                     /**< \brief [19:16] Interrupt Node Pointer for Interrupt TBI (rw) */
    unsigned int ERRI:4;                    /**< \brief [23:20] Interrupt Node Pointer for Interrupt ERRI (rw) */
    unsigned int SDI:4;                     /**< \brief [27:24] Interrupt Node Pointer for Interrupt SDI (rw) */
    unsigned int FWI:4;                     /**< \brief [31:28] Interrupt Node Pointer for FWI (rw) */
} Ifx_PSI5_INP_Bits;

/** \\brief  Interrupt Clear Register A */
typedef struct _Ifx_PSI5_INTCLRA_Bits
{
    unsigned int RSI:1;                     /**< \brief [0:0] Clear Interrupt Request Flag RSI (w) */
    unsigned int RDI:1;                     /**< \brief [1:1] Clear Interrupt Request Flag RDI (w) */
    unsigned int RBI:1;                     /**< \brief [2:2] Clear Interrupt Request Flag RBI (w) */
    unsigned int TEI:1;                     /**< \brief [3:3] Clear Interrupt Request Flag TEI (w) */
    unsigned int NBI:1;                     /**< \brief [4:4] Clear Interrupt Request Flag NBI (w) */
    unsigned int MEI:1;                     /**< \brief [5:5] Clear Interrupt Request Flag MEI (w) */
    unsigned int CRCI:1;                    /**< \brief [6:6] Clear Interrupt Request Flag CRCI (w) */
    unsigned int FWI:1;                     /**< \brief [7:7] Clear Interrupt Request Flag FWI (w) */
    unsigned int RUI:1;                     /**< \brief [8:8] Clear Interrupt Request Flag RUI (w) */
    unsigned int RMI:1;                     /**< \brief [9:9] Clear Interrupt Request Flag RMI (w) */
    unsigned int TPI:1;                     /**< \brief [10:10] Clear Interrupt Request Flag TPI (w) */
    unsigned int TPOI:1;                    /**< \brief [11:11] Clear Interrupt Request Flag TPOI (w) */
    unsigned int TSI:1;                     /**< \brief [12:12] Clear Interrupt Request Flag TSI (w) */
    unsigned int TSOI:1;                    /**< \brief [13:13] Clear Interrupt Request Flag TSOI (w) */
    unsigned int TOI:1;                     /**< \brief [14:14] Clear Interrupt Request Flag TOI (w) */
    unsigned int TOOI:1;                    /**< \brief [15:15] Clear Interrupt Request Flag TOOI (w) */
    unsigned int NFI:1;                     /**< \brief [16:16] Clear Interrupt Request Flag NFI (w) */
    unsigned int reserved_17:15;            /**< \brief \internal Reserved */
} Ifx_PSI5_INTCLRA_Bits;

/** \\brief  Interrupt Clear Register A */
typedef struct _Ifx_PSI5_INTCLRB_Bits
{
    unsigned int WSI0:1;                    /**< \brief [0:0] Clear Interrupt Request Flag WSIy (w) */
    unsigned int WSI1:1;                    /**< \brief [1:1] Clear Interrupt Request Flag WSIy (w) */
    unsigned int WSI2:1;                    /**< \brief [2:2] Clear Interrupt Request Flag WSIy (w) */
    unsigned int WSI3:1;                    /**< \brief [3:3] Clear Interrupt Request Flag WSIy (w) */
    unsigned int WSI4:1;                    /**< \brief [4:4] Clear Interrupt Request Flag WSIy (w) */
    unsigned int WSI5:1;                    /**< \brief [5:5] Clear Interrupt Request Flag WSIy (w) */
    unsigned int SDI0:1;                    /**< \brief [6:6] Clear Interrupt Request Flag SDIy (w) */
    unsigned int SDI1:1;                    /**< \brief [7:7] Clear Interrupt Request Flag SDIy (w) */
    unsigned int SDI2:1;                    /**< \brief [8:8] Clear Interrupt Request Flag SDIy (w) */
    unsigned int SDI3:1;                    /**< \brief [9:9] Clear Interrupt Request Flag SDIy (w) */
    unsigned int SDI4:1;                    /**< \brief [10:10] Clear Interrupt Request Flag SDIy (w) */
    unsigned int SDI5:1;                    /**< \brief [11:11] Clear Interrupt Request Flag SDIy (w) */
    unsigned int SOI0:1;                    /**< \brief [12:12] Clear Interrupt Request Flag SOIy (w) */
    unsigned int SOI1:1;                    /**< \brief [13:13] Clear Interrupt Request Flag SOIy (w) */
    unsigned int SOI2:1;                    /**< \brief [14:14] Clear Interrupt Request Flag SOIy (w) */
    unsigned int SOI3:1;                    /**< \brief [15:15] Clear Interrupt Request Flag SOIy (w) */
    unsigned int SOI4:1;                    /**< \brief [16:16] Clear Interrupt Request Flag SOIy (w) */
    unsigned int SOI5:1;                    /**< \brief [17:17] Clear Interrupt Request Flag SOIy (w) */
    unsigned int SCRI0:1;                   /**< \brief [18:18] Clear Interrupt Request Flag SCRIy (w) */
    unsigned int SCRI1:1;                   /**< \brief [19:19] Clear Interrupt Request Flag SCRIy (w) */
    unsigned int SCRI2:1;                   /**< \brief [20:20] Clear Interrupt Request Flag SCRIy (w) */
    unsigned int SCRI3:1;                   /**< \brief [21:21] Clear Interrupt Request Flag SCRIy (w) */
    unsigned int SCRI4:1;                   /**< \brief [22:22] Clear Interrupt Request Flag SCRIy (w) */
    unsigned int SCRI5:1;                   /**< \brief [23:23] Clear Interrupt Request Flag SCRIy (w) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_PSI5_INTCLRB_Bits;

