HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxPsi5_regdef.h
/** \\brief  MEI Overview Register */
typedef struct _Ifx_PSI5_MEIOV_Bits
{
    unsigned int MEI0:1;                    /**< \brief [0:0] MEI Flag of Buffer y (rh) */
    unsigned int MEI1:1;                    /**< \brief [1:1] MEI Flag of Buffer y (rh) */
    unsigned int MEI2:1;                    /**< \brief [2:2] MEI Flag of Buffer y (rh) */
    unsigned int MEI3:1;                    /**< \brief [3:3] MEI Flag of Buffer y (rh) */
    unsigned int MEI4:1;                    /**< \brief [4:4] MEI Flag of Buffer y (rh) */
    unsigned int MEI5:1;                    /**< \brief [5:5] MEI Flag of Buffer y (rh) */
    unsigned int MEI6:1;                    /**< \brief [6:6] MEI Flag of Buffer y (rh) */
    unsigned int MEI7:1;                    /**< \brief [7:7] MEI Flag of Buffer y (rh) */
    unsigned int MEI8:1;                    /**< \brief [8:8] MEI Flag of Buffer y (rh) */
    unsigned int MEI9:1;                    /**< \brief [9:9] MEI Flag of Buffer y (rh) */
    unsigned int MEI10:1;                   /**< \brief [10:10] MEI Flag of Buffer y (rh) */
    unsigned int MEI11:1;                   /**< \brief [11:11] MEI Flag of Buffer y (rh) */
    unsigned int MEI12:1;                   /**< \brief [12:12] MEI Flag of Buffer y (rh) */
    unsigned int MEI13:1;                   /**< \brief [13:13] MEI Flag of Buffer y (rh) */
    unsigned int MEI14:1;                   /**< \brief [14:14] MEI Flag of Buffer y (rh) */
    unsigned int MEI15:1;                   /**< \brief [15:15] MEI Flag of Buffer y (rh) */
    unsigned int MEI16:1;                   /**< \brief [16:16] MEI Flag of Buffer y (rh) */
    unsigned int MEI17:1;                   /**< \brief [17:17] MEI Flag of Buffer y (rh) */
    unsigned int MEI18:1;                   /**< \brief [18:18] MEI Flag of Buffer y (rh) */
    unsigned int MEI19:1;                   /**< \brief [19:19] MEI Flag of Buffer y (rh) */
    unsigned int MEI20:1;                   /**< \brief [20:20] MEI Flag of Buffer y (rh) */
    unsigned int MEI21:1;                   /**< \brief [21:21] MEI Flag of Buffer y (rh) */
    unsigned int MEI22:1;                   /**< \brief [22:22] MEI Flag of Buffer y (rh) */
    unsigned int MEI23:1;                   /**< \brief [23:23] MEI Flag of Buffer y (rh) */
    unsigned int MEI24:1;                   /**< \brief [24:24] MEI Flag of Buffer y (rh) */
    unsigned int MEI25:1;                   /**< \brief [25:25] MEI Flag of Buffer y (rh) */
    unsigned int MEI26:1;                   /**< \brief [26:26] MEI Flag of Buffer y (rh) */
    unsigned int MEI27:1;                   /**< \brief [27:27] MEI Flag of Buffer y (rh) */
    unsigned int MEI28:1;                   /**< \brief [28:28] MEI Flag of Buffer y (rh) */
    unsigned int MEI29:1;                   /**< \brief [29:29] MEI Flag of Buffer y (rh) */
    unsigned int MEI30:1;                   /**< \brief [30:30] MEI Flag of Buffer y (rh) */
    unsigned int MEI31:1;                   /**< \brief [31:31] MEI Flag of Buffer y (rh) */
} Ifx_PSI5_MEIOV_Bits;

/** \\brief  MEIOV Set Register */
typedef struct _Ifx_PSI5_MEISET_Bits
{
    unsigned int MEI0:1;                    /**< \brief [0:0] Set MEI Flag of Buffer y (w) */
    unsigned int MEI1:1;                    /**< \brief [1:1] Set MEI Flag of Buffer y (w) */
    unsigned int MEI2:1;                    /**< \brief [2:2] Set MEI Flag of Buffer y (w) */
    unsigned int MEI3:1;                    /**< \brief [3:3] Set MEI Flag of Buffer y (w) */
    unsigned int MEI4:1;                    /**< \brief [4:4] Set MEI Flag of Buffer y (w) */
    unsigned int MEI5:1;                    /**< \brief [5:5] Set MEI Flag of Buffer y (w) */
    unsigned int MEI6:1;                    /**< \brief [6:6] Set MEI Flag of Buffer y (w) */
    unsigned int MEI7:1;                    /**< \brief [7:7] Set MEI Flag of Buffer y (w) */
    unsigned int MEI8:1;                    /**< \brief [8:8] Set MEI Flag of Buffer y (w) */
    unsigned int MEI9:1;                    /**< \brief [9:9] Set MEI Flag of Buffer y (w) */
    unsigned int MEI10:1;                   /**< \brief [10:10] Set MEI Flag of Buffer y (w) */
    unsigned int MEI11:1;                   /**< \brief [11:11] Set MEI Flag of Buffer y (w) */
    unsigned int MEI12:1;                   /**< \brief [12:12] Set MEI Flag of Buffer y (w) */
    unsigned int MEI13:1;                   /**< \brief [13:13] Set MEI Flag of Buffer y (w) */
    unsigned int MEI14:1;                   /**< \brief [14:14] Set MEI Flag of Buffer y (w) */
    unsigned int MEI15:1;                   /**< \brief [15:15] Set MEI Flag of Buffer y (w) */
    unsigned int MEI16:1;                   /**< \brief [16:16] Set MEI Flag of Buffer y (w) */
    unsigned int MEI17:1;                   /**< \brief [17:17] Set MEI Flag of Buffer y (w) */
    unsigned int MEI18:1;                   /**< \brief [18:18] Set MEI Flag of Buffer y (w) */
    unsigned int MEI19:1;                   /**< \brief [19:19] Set MEI Flag of Buffer y (w) */
    unsigned int MEI20:1;                   /**< \brief [20:20] Set MEI Flag of Buffer y (w) */
    unsigned int MEI21:1;                   /**< \brief [21:21] Set MEI Flag of Buffer y (w) */
    unsigned int MEI22:1;                   /**< \brief [22:22] Set MEI Flag of Buffer y (w) */
    unsigned int MEI23:1;                   /**< \brief [23:23] Set MEI Flag of Buffer y (w) */
    unsigned int MEI24:1;                   /**< \brief [24:24] Set MEI Flag of Buffer y (w) */
    unsigned int MEI25:1;                   /**< \brief [25:25] Set MEI Flag of Buffer y (w) */
    unsigned int MEI26:1;                   /**< \brief [26:26] Set MEI Flag of Buffer y (w) */
    unsigned int MEI27:1;                   /**< \brief [27:27] Set MEI Flag of Buffer y (w) */
    unsigned int MEI28:1;                   /**< \brief [28:28] Set MEI Flag of Buffer y (w) */
    unsigned int MEI29:1;                   /**< \brief [29:29] Set MEI Flag of Buffer y (w) */
    unsigned int MEI30:1;                   /**< \brief [30:30] Set MEI Flag of Buffer y (w) */
    unsigned int MEI31:1;                   /**< \brief [31:31] Set MEI Flag of Buffer y (w) */
} Ifx_PSI5_MEISET_Bits;

