HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxPsi5_regdef.h
/** \\brief  OCDS Control and Status */
typedef struct _Ifx_PSI5_OCS_Bits
{
    unsigned int reserved_0:24;             /**< \brief \internal Reserved */
    unsigned int SUS:4;                     /**< \brief [27:24] OCDS Suspend Control (rw) */
    unsigned int SUS_P:1;                   /**< \brief [28:28] SUS Write Protection (w) */
    unsigned int SUSSTA:1;                  /**< \brief [29:29] Suspend State (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_PSI5_OCS_Bits;

/** \\brief  Receive Data FIFO */
typedef struct _Ifx_PSI5_RDF_Bits
{
    unsigned int RD:32;                     /**< \brief [31:0] RD (rh) */
} Ifx_PSI5_RDF_Bits;

/** \\brief  RDIOV Clear Register */
typedef struct _Ifx_PSI5_RDICLR_Bits
{
    unsigned int RDI0:1;                    /**< \brief [0:0] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI1:1;                    /**< \brief [1:1] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI2:1;                    /**< \brief [2:2] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI3:1;                    /**< \brief [3:3] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI4:1;                    /**< \brief [4:4] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI5:1;                    /**< \brief [5:5] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI6:1;                    /**< \brief [6:6] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI7:1;                    /**< \brief [7:7] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI8:1;                    /**< \brief [8:8] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI9:1;                    /**< \brief [9:9] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI10:1;                   /**< \brief [10:10] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI11:1;                   /**< \brief [11:11] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI12:1;                   /**< \brief [12:12] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI13:1;                   /**< \brief [13:13] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI14:1;                   /**< \brief [14:14] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI15:1;                   /**< \brief [15:15] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI16:1;                   /**< \brief [16:16] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI17:1;                   /**< \brief [17:17] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI18:1;                   /**< \brief [18:18] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI19:1;                   /**< \brief [19:19] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI20:1;                   /**< \brief [20:20] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI21:1;                   /**< \brief [21:21] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI22:1;                   /**< \brief [22:22] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI23:1;                   /**< \brief [23:23] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI24:1;                   /**< \brief [24:24] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI25:1;                   /**< \brief [25:25] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI26:1;                   /**< \brief [26:26] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI27:1;                   /**< \brief [27:27] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI28:1;                   /**< \brief [28:28] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI29:1;                   /**< \brief [29:29] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI30:1;                   /**< \brief [30:30] Clear RDI Flag of Buffer y (w) */
    unsigned int RDI31:1;                   /**< \brief [31:31] Clear RDI Flag of Buffer y (w) */
} Ifx_PSI5_RDICLR_Bits;

/** \\brief  RDI Overview Register */
typedef struct _Ifx_PSI5_RDIOV_Bits
{
    unsigned int RDI0:1;                    /**< \brief [0:0] RDI Flag of Buffer y (rh) */
    unsigned int RDI1:1;                    /**< \brief [1:1] RDI Flag of Buffer y (rh) */
    unsigned int RDI2:1;                    /**< \brief [2:2] RDI Flag of Buffer y (rh) */
    unsigned int RDI3:1;                    /**< \brief [3:3] RDI Flag of Buffer y (rh) */
    unsigned int RDI4:1;                    /**< \brief [4:4] RDI Flag of Buffer y (rh) */
    unsigned int RDI5:1;                    /**< \brief [5:5] RDI Flag of Buffer y (rh) */
    unsigned int RDI6:1;                    /**< \brief [6:6] RDI Flag of Buffer y (rh) */
    unsigned int RDI7:1;                    /**< \brief [7:7] RDI Flag of Buffer y (rh) */
    unsigned int RDI8:1;                    /**< \brief [8:8] RDI Flag of Buffer y (rh) */
    unsigned int RDI9:1;                    /**< \brief [9:9] RDI Flag of Buffer y (rh) */
    unsigned int RDI10:1;                   /**< \brief [10:10] RDI Flag of Buffer y (rh) */
    unsigned int RDI11:1;                   /**< \brief [11:11] RDI Flag of Buffer y (rh) */
    unsigned int RDI12:1;                   /**< \brief [12:12] RDI Flag of Buffer y (rh) */
    unsigned int RDI13:1;                   /**< \brief [13:13] RDI Flag of Buffer y (rh) */
    unsigned int RDI14:1;                   /**< \brief [14:14] RDI Flag of Buffer y (rh) */
    unsigned int RDI15:1;                   /**< \brief [15:15] RDI Flag of Buffer y (rh) */
    unsigned int RDI16:1;                   /**< \brief [16:16] RDI Flag of Buffer y (rh) */
    unsigned int RDI17:1;                   /**< \brief [17:17] RDI Flag of Buffer y (rh) */
    unsigned int RDI18:1;                   /**< \brief [18:18] RDI Flag of Buffer y (rh) */
    unsigned int RDI19:1;                   /**< \brief [19:19] RDI Flag of Buffer y (rh) */
    unsigned int RDI20:1;                   /**< \brief [20:20] RDI Flag of Buffer y (rh) */
    unsigned int RDI21:1;                   /**< \brief [21:21] RDI Flag of Buffer y (rh) */
    unsigned int RDI22:1;                   /**< \brief [22:22] RDI Flag of Buffer y (rh) */
    unsigned int RDI23:1;                   /**< \brief [23:23] RDI Flag of Buffer y (rh) */
    unsigned int RDI24:1;                   /**< \brief [24:24] RDI Flag of Buffer y (rh) */
    unsigned int RDI25:1;                   /**< \brief [25:25] RDI Flag of Buffer y (rh) */
    unsigned int RDI26:1;                   /**< \brief [26:26] RDI Flag of Buffer y (rh) */
    unsigned int RDI27:1;                   /**< \brief [27:27] RDI Flag of Buffer y (rh) */
    unsigned int RDI28:1;                   /**< \brief [28:28] RDI Flag of Buffer y (rh) */
    unsigned int RDI29:1;                   /**< \brief [29:29] RDI Flag of Buffer y (rh) */
    unsigned int RDI30:1;                   /**< \brief [30:30] RDI Flag of Buffer y (rh) */
    unsigned int RDI31:1;                   /**< \brief [31:31] RDI Flag of Buffer y (rh) */
} Ifx_PSI5_RDIOV_Bits;

/** \\brief  RDIOV Set Register */
typedef struct _Ifx_PSI5_RDISET_Bits
{
    unsigned int RDI0:1;                    /**< \brief [0:0] Set RDI Flag of Buffer y (w) */
    unsigned int RDI1:1;                    /**< \brief [1:1] Set RDI Flag of Buffer y (w) */
    unsigned int RDI2:1;                    /**< \brief [2:2] Set RDI Flag of Buffer y (w) */
    unsigned int RDI3:1;                    /**< \brief [3:3] Set RDI Flag of Buffer y (w) */
    unsigned int RDI4:1;                    /**< \brief [4:4] Set RDI Flag of Buffer y (w) */
    unsigned int RDI5:1;                    /**< \brief [5:5] Set RDI Flag of Buffer y (w) */
    unsigned int RDI6:1;                    /**< \brief [6:6] Set RDI Flag of Buffer y (w) */
    unsigned int RDI7:1;                    /**< \brief [7:7] Set RDI Flag of Buffer y (w) */
    unsigned int RDI8:1;                    /**< \brief [8:8] Set RDI Flag of Buffer y (w) */
    unsigned int RDI9:1;                    /**< \brief [9:9] Set RDI Flag of Buffer y (w) */
    unsigned int RDI10:1;                   /**< \brief [10:10] Set RDI Flag of Buffer y (w) */
    unsigned int RDI11:1;                   /**< \brief [11:11] Set RDI Flag of Buffer y (w) */
    unsigned int RDI12:1;                   /**< \brief [12:12] Set RDI Flag of Buffer y (w) */
    unsigned int RDI13:1;                   /**< \brief [13:13] Set RDI Flag of Buffer y (w) */
    unsigned int RDI14:1;                   /**< \brief [14:14] Set RDI Flag of Buffer y (w) */
    unsigned int RDI15:1;                   /**< \brief [15:15] Set RDI Flag of Buffer y (w) */
    unsigned int RDI16:1;                   /**< \brief [16:16] Set RDI Flag of Buffer y (w) */
    unsigned int RDI17:1;                   /**< \brief [17:17] Set RDI Flag of Buffer y (w) */
    unsigned int RDI18:1;                   /**< \brief [18:18] Set RDI Flag of Buffer y (w) */
    unsigned int RDI19:1;                   /**< \brief [19:19] Set RDI Flag of Buffer y (w) */
    unsigned int RDI20:1;                   /**< \brief [20:20] Set RDI Flag of Buffer y (w) */
    unsigned int RDI21:1;                   /**< \brief [21:21] Set RDI Flag of Buffer y (w) */
    unsigned int RDI22:1;                   /**< \brief [22:22] Set RDI Flag of Buffer y (w) */
    unsigned int RDI23:1;                   /**< \brief [23:23] Set RDI Flag of Buffer y (w) */
    unsigned int RDI24:1;                   /**< \brief [24:24] Set RDI Flag of Buffer y (w) */
    unsigned int RDI25:1;                   /**< \brief [25:25] Set RDI Flag of Buffer y (w) */
    unsigned int RDI26:1;                   /**< \brief [26:26] Set RDI Flag of Buffer y (w) */
    unsigned int RDI27:1;                   /**< \brief [27:27] Set RDI Flag of Buffer y (w) */
    unsigned int RDI28:1;                   /**< \brief [28:28] Set RDI Flag of Buffer y (w) */
    unsigned int RDI29:1;                   /**< \brief [29:29] Set RDI Flag of Buffer y (w) */
    unsigned int RDI30:1;                   /**< \brief [30:30] Set RDI Flag of Buffer y (w) */
    unsigned int RDI31:1;                   /**< \brief [31:31] Set RDI Flag of Buffer y (w) */
} Ifx_PSI5_RDISET_Bits;

/** \\brief  Receive Data Memory High */
typedef struct _Ifx_PSI5_RDM_H_Bits
{
    unsigned int TS:24;                     /**< \brief [23:0] Time Stamp (rh) */
    unsigned int SC:3;                      /**< \brief [26:24] Slot Counter (rh) */
    unsigned int TEI:1;                     /**< \brief [27:27] Time Slot Error Flag (rh) */
    unsigned int NBI:1;                     /**< \brief [28:28] Number of bits Error Flag (rh) */
    unsigned int MEI:1;                     /**< \brief [29:29] Error in Messaging Bits Flag (rh) */
    unsigned int NFI:1;                     /**< \brief [30:30] No Frame Received Flag (rh) */
    unsigned int RMI:1;                     /**< \brief [31:31] Receive Memory Overflow Flag (rh) */
} Ifx_PSI5_RDM_H_Bits;

